## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] has changed
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Web/sites/find-a-tp-pr-409"
        name                              = "find-a-tp-pr-409"
        tags                              = {
            "Environment"      = "Dev"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }

      ~ site_config {
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          + x_fd_health_probe = []
                          + x_forwarded_for   = []
                          + x_forwarded_host  = []
                            # (1 unchanged attribute hidden)
                        },
                    ]
                    name                      = "Allow CDN Traffic"
                    # (5 unchanged attributes hidden)
                },
            ]
            # (24 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409logs"
        name                              = "findatppr409logs"
        tags                              = {
            "Environment"      = "Dev"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              + "172.190.111.146",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-409applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-409httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.function_app_service will be updated in-place
  ~ resource "azurerm_application_insights" "function_app_service" {
        id                                    = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/components/find-a-tp-pr-409-insights-fa"
        name                                  = "find-a-tp-pr-409-insights-fa"
      ~ tags                                  = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (16 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.web_app_service will be updated in-place
  ~ resource "azurerm_application_insights" "web_app_service" {
        id                                    = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/components/find-a-tp-pr-409-insights"
        name                                  = "find-a-tp-pr-409-insights"
      ~ tags                                  = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (16 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights_standard_web_test.web_app_service[0] will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "web_app_service" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/webTests/find-a-tp-pr-409-http"
        name                    = "find-a-tp-pr-409-http"
      ~ tags                    = {
          ~ "Environment"                                                                                                                                                         = "Dev" -> "pr-409"
            "Product"                                                                                                                                                             = "National Tutoring Programme"
            "Service Offering"                                                                                                                                                    = "National Tutoring Programme"
            "hidden-link:/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/components/find-a-tp-pr-409-insights" = "Resource"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
        id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Cdn/profiles/find-a-tp-pr-409-cdn/afdEndpoints/find-a-tp-pr-409-cdnendpoint"
        name                     = "find-a-tp-pr-409-cdnendpoint"
      ~ tags                     = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (3 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_firewall_policy.waf[0] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/findatppr409waf"
        name                              = "findatppr409waf"
      ~ tags                              = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_profile.cdn[0] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "cdn" {
        id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Cdn/profiles/find-a-tp-pr-409-cdn"
        name                     = "find-a-tp-pr-409-cdn"
      ~ tags                     = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (4 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault.default will be updated in-place
  ~ resource "azurerm_key_vault" "default" {
        id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-409-kv"
        name                            = "find-a-tp-pr-409-kv"
      ~ tags                            = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-409-kv"
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageenquiriesdataclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageenquiriesdataclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-409-kv"
      + name                    = "BlobStorageEnquiriesData--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-409-kv"
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-409-kv"
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"          = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"   = (sensitive value)
            # (7 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Web/sites/find-a-tp-pr-409-fa"
        name                              = "find-a-tp-pr-409-fa"
      ~ tags                              = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Web/sites/find-a-tp-pr-409"
        name                              = "find-a-tp-pr-409"
      ~ tags                              = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.function_app_service will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "function_app_service" {
        id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-409-functionappservice"
        name                            = "find-a-tp-pr-409-functionappservice"
      ~ tags                            = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.web_app_service will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "web_app_service" {
        id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-409-webappservice"
        name                            = "find-a-tp-pr-409-webappservice"
      ~ tags                            = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_workflow.webhook[0] will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "webhook" {
        id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Logic/workflows/find-a-tp-pr-409-webhook-workflow"
        name                            = "find-a-tp-pr-409-webhook-workflow"
      ~ tags                            = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (10 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_action_group.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "web_app_service" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-409-actiongroup"
        name                = "find-a-tp-pr-409-actiongroup"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (4 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_postgresql_flexible_server[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_postgresql_flexible_server" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-409-webappservice"
      + name                           = "find-a-tp-pr-409-postgresql-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "PostgreSQLFlexDatabaseXacts"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreRuntime"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreWaitStats"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexSessions"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexTableStats"

          + retention_policy {
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLLogs"

          + retention_policy {
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Cache/redis/find-a-tp-pr-409-redis-cache|find-a-tp-pr-409-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-409-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409falogs|find-a-tp-pr-409-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-409-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409logs|find-a-tp-pr-409-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-409-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Logic/workflows/find-a-tp-pr-409-webhook-workflow|find-a-tp-pr-409-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-409-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cpu" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-409-cpu"
        name                = "find-a-tp-pr-409-cpu"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "http" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-409-http"
        name                = "find-a-tp-pr-409-http"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "latency" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-409-cdn-latency"
        name                = "find-a-tp-pr-409-cdn-latency"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "memory" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-409-memory"
        name                = "find-a-tp-pr-409-memory"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.data_extraction_fa_error_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "data_extraction_fa_error_alert" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-409-fa-data-extraction-errors"
        name                    = "find-a-tp-pr-409-fa-data-extraction-errors"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.email_processing_fa_error_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "email_processing_fa_error_alert" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-409-fa-email-processing-errors"
        name                    = "find-a-tp-pr-409-fa-email-processing-errors"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.function_app_down_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "function_app_down_alert" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-409-faapp-down"
        name                    = "find-a-tp-pr-409-faapp-down"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-409-webapp-errors"
        name                    = "find-a-tp-pr-409-webapp-errors"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_nat_gateway.default[0] will be updated in-place
  ~ resource "azurerm_nat_gateway" "default" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/natGateways/find-a-tp-pr-409-default"
        name                    = "find-a-tp-pr-409-default"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_network_security_group.web_app_service_infra_allow_frontdoor_inbound_only[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "web_app_service_infra_allow_frontdoor_inbound_only" {
        id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/networkSecurityGroups/find-a-tp-pr-409-webappserviceinfransg"
        name                = "find-a-tp-pr-409-webappserviceinfransg"
      ~ tags                = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (3 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default will be created
  + resource "azurerm_postgresql_flexible_server" "default" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "find-a-tp-pr-409-psqlflexible-server"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "s177d01-ntp-pr-409"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + tags                          = {
          + "Environment"      = "pr-409"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + version                       = "14"
      + zone                          = "1"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_configuration.extensions[0] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "CITEXT,UUID-OSSP"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_database.default will be created
  + resource "azurerm_postgresql_flexible_server_database" "default" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "find-a-tp-pr-409-db"
      + server_id = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server_firewall_rule.web_app_default_static_ip[0] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "web_app_default_static_ip" {
      + end_ip_address   = "40.68.247.89"
      + id               = (known after apply)
      + name             = "find-a-tp-pr-409webapp"
      + server_id        = (known after apply)
      + start_ip_address = "40.68.247.89"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_public_ip.nat_gateway[0] will be updated in-place
  ~ resource "azurerm_public_ip" "nat_gateway" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/publicIPAddresses/find-a-tp-pr-409-natgateway"
        name                    = "find-a-tp-pr-409-natgateway"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (11 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_redis_cache.default will be updated in-place
  ~ resource "azurerm_redis_cache" "default" {
        id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Cache/redis/find-a-tp-pr-409-redis-cache"
        name                          = "find-a-tp-pr-409-redis-cache"
      ~ tags                          = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409"
        name     = "s177d01-ntp-pr-409"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_route_table.default[0] will be updated in-place
  ~ resource "azurerm_route_table" "default" {
        id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/routeTables/find-a-tp-pr-409-default"
        name                          = "find-a-tp-pr-409-default"
      ~ tags                          = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (5 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_service_plan.default will be updated in-place
  ~ resource "azurerm_service_plan" "default" {
        id                           = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Web/serverfarms/find-a-tp-pr-409"
        name                         = "find-a-tp-pr-409"
      ~ tags                         = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (10 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.functionapplogs[0] will be updated in-place
  ~ resource "azurerm_storage_account" "functionapplogs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409falogs"
        name                              = "findatppr409falogs"
      ~ tags                              = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409logs"
        name                              = "findatppr409logs"
      ~ tags                              = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be created
  + resource "azurerm_storage_account_network_rules" "logs" {
      + bypass                     = [
          + "AzureServices",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = [
          + "40.68.247.89",
        ]
      + storage_account_id         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Storage/storageAccounts/findatppr409logs"
      + virtual_network_subnet_ids = [
          + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-409-default/subnets/find-a-tp-pr-409-webappserviceinfra",
        ]

      + private_link_access {
          + endpoint_resource_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Web/sites/find-a-tp-pr-409"
          + endpoint_tenant_id   = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_virtual_network.default[0] will be updated in-place
  ~ resource "azurerm_virtual_network" "default" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-409/providers/Microsoft.Network/virtualNetworks/find-a-tp-pr-409-default"
        name                    = "find-a-tp-pr-409-default"
      ~ tags                    = {
          ~ "Environment"      = "Dev" -> "pr-409"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 10 to add, 35 to change, 0 to destroy.
```
</details>